Extensions installed on SSH: nuc9-linux:
aaron-bond.better-comments
adpyke.codesnap
amazonwebservices.codewhisperer-for-command-line-companion
anthropic.claude-code
atian25.copy-syntax
chrischinchilla.vscode-pandoc
dbaeumer.vscode-eslint
enkia.tokyo-night
esbenp.prettier-vscode
github.copilot
github.copilot-chat
james-yu.latex-workshop
jebbs.plantuml
llvm-vs-code-extensions.lldb-dap
mathworks.language-matlab
mechatroner.rainbow-csv
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
mskelton.one-dark-theme
openai.chatgpt
quicktype.quicktype
redhat.java
redhat.vscode-yaml
reditorsupport.r
reditorsupport.r-syntax
swiftlang.swift-vscode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
yzane.markdown-pdf
